#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloud_router.google_compute_router.cloud_router["gc-cloud-router"] will be created
  + resource "google_compute_router" "cloud_router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "gc-cloud-router"
      + network            = (known after apply)
      + project            = "gcp-allex-vpc"
      + region             = "us-central1"
      + self_link          = (known after apply)
    }

  # module.firewall.google_compute_firewall.vpc_firewall_rule["permitall"] will be created
  + resource "google_compute_firewall" "vpc_firewall_rule" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "permitall"
      + network            = (known after apply)
      + priority           = 10000
      + project            = "gcp-allex-vpc"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # module.nat.google_compute_router_nat.gcp-nat["gcp-nat"] will be created
  + resource "google_compute_router_nat" "gcp-nat" {
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = true
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + name                                = "gcp-nat"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + project                             = "gcp-allex-vpc"
      + region                              = "us-central1"
      + router                              = "gc-cloud-router"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_time_wait_timeout_sec           = 120
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30
    }

  # module.subnet.google_compute_subnetwork.subnetwork["l7-us-central1-allex-vpc-1-proxy-only"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "192.168.32.0/25"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "l7-us-central1-allex-vpc-1-proxy-only"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "gcp-allex-vpc"
      + purpose                    = "REGIONAL_MANAGED_PROXY"
      + region                     = "us-central1"
      + role                       = "ACTIVE"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.subnet.google_compute_subnetwork.subnetwork["us-central1-allex-vpc-1-sb-01"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.255.255.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "us-central1-allex-vpc-1-sb-01"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "gcp-allex-vpc"
      + purpose                    = "PRIVATE"
      + region                     = "us-central1"
      + secondary_ip_range         = [
          + {
              + ip_cidr_range = "192.168.36.0/25"
              + range_name    = "us-central1-gke-svcs-1"
            },
          + {
              + ip_cidr_range = "192.168.35.0/24"
              + range_name    = "us-central1-gke-pods-1"
            },
        ]
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.subnet.google_compute_subnetwork.subnetwork["us-central1-allex-vpc-1-sb-02"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.255.254.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "us-central1-allex-vpc-1-sb-02"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "gcp-allex-vpc"
      + purpose                    = "PRIVATE"
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.vpc.google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + description                               = "VPC  us-central1-allex-vpc-01 created in gcp-allex-vpc"
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "us-central1-allex-vpc-01"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + project                                   = "gcp-allex-vpc"
      + routing_mode                              = "REGIONAL"
      + self_link                                 = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jithinpnjm, Action: `pull_request`, Working Directory: ``, Workflow: `gcp_bootstrap_vpc1`*